Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HOST/Core/Src/USB_Host_Device_Manager.c
/*
 * USB_Host_Device_Manager.c
 *
 *  Created on: Jun 28, 2024
 *      Author: Jack Herron
 */

#include <stdlib.h>                      // Include C standard library for memory allocation functions
#include <stdint.h>                      // Include C library for fixed-width integer types
#include <stm32f4xx.h>                   // Include MCU-specific definitions for STM32F4xx series
#include <stdbool.h>                     // Include C library for boolean type

#include "../Inc/USB_Host.h"             // Include USB host definitions
#include "../../Config/USB_Host_Config.h"// Include USB host configuration settings
#include "../Inc/USB_Host_Device_Manager.h" // Include USB host device manager definitions

// Static array of port structures for managing USB ports
static USB_Host_Device_Manager___Port_TypeDef USB_Host_Device_Manager___Port[USB_Host___NUMBER_OF_PORTS] = {0};

#if USB_Host_Config___DYNAMICALLY_ALLOCATE_DEVICES == false

    // Static pool of device structures for device allocation
    USB_Host_Device_Manager___Device_TypeDef device_Pool[USB_Host_Device_Manager___DEVICE_POOL_SIZE] = {0};

    // Function to allocate a device from the static pool
    USB_Host_Device_Manager___Device_TypeDef* USB_Host_Device_Manager___Allocate_Device()
    {
        // Iterate through the device pool to find an unallocated device
        for(uint16_t i = 0; i < USB_Host_Device_Manager___DEVICE_POOL_SIZE; i++)
        {
            if(device_Pool[i].is_Allocated == false)
            {
                device_Pool[i].is_Allocated = true;  // Mark the device as allocated
                return(&device_Pool[i]);             // Return pointer to the allocated device
            }
        }
        return(NULL);  // Return NULL if no unallocated device is found
    }

    // Function to free a device back to the static pool
    void USB_Host_Device_Manager___Free_Device(USB_Host_Device_Manager___Device_TypeDef* p_Device)
    {
        p_Device->is_Allocated = false;  // Mark the device as unallocated
    }

#else

    // Function to allocate a device dynamically using malloc
    USB_Host_Device_Manager___Device_TypeDef* USB_Host_Device_Manager___Allocate_Device()
    {
        USB_Host_Device_Manager___Device_TypeDef* p_Device = NULL;

        p_Device = (USB_Host_Device_Manager___Device_TypeDef*)malloc(sizeof(USB_Host_Device_Manager___Device_TypeDef));
        if(p_Device != NULL)
        {
            p_Device->is_Allocated = true;  // Mark the device as allocated
        }
        return(p_Device);  // Return pointer to the allocated device or NULL if allocation failed
    }

    // Function to free a dynamically allocated device
    void USB_Host_Device_Manager___Free_Device(USB_Host_Device_Manager___Device_TypeDef* p_Device)
    {
        free(p_Device);  // Free the memory allocated for the device
    }

#endif // USB_Host_Config___DYNAMICALLY_ALLOCATE_DEVICES

// Polling device list for managing periodic device operations
USB_Host_Device_Manager___Polling_Device_List_Typedef USB_Host_Device_Manager___Polling_List[2] = {0};

// Function to add a device to the polling list
void USB_Host_Device_Manager___Add_Polling_Device(uint8_t port_Number, uint8_t device_Address, uint16_t polling_Period, void callback(uint8_t port_Number , uint8_t device_Address))
{
    // Get the polling node associated with the device
    USB_Host_Device_Manager___Polling_Device_Node_TypeDef* p_Polling_Node = &(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->polling_Process);

    if(p_Polling_Node != NULL)
    {
        // Initialize the polling node parameters
        p_Polling_Node->enabled        = true;
        p_Polling_Node->device_Address = device_Address;
        p_Polling_Node->polling_Target = polling_Period;
        p_Polling_Node->polling_Counter = 0;
        p_Polling_Node->callback       = callback;
        p_Polling_Node->next_Node      = NULL;
        p_Polling_Node->previous_Node  = NULL;

        // Add the polling node to the polling list
        if(USB_Host_Device_Manager___Polling_List[port_Number].first_Node != NULL)
        {
            p_Polling_Node->previous_Node = USB_Host_Device_Manager___Polling_List[port_Number].last_Node;
            USB_Host_Device_Manager___Polling_List[port_Number].last_Node->next_Node = p_Polling_Node;
            USB_Host_Device_Manager___Polling_List[port_Number].last_Node = p_Polling_Node;
        }
        else
        {
            // If the list is empty, initialize it with the new node
            USB_Host_Device_Manager___Polling_List[port_Number].last_Node = p_Polling_Node;
            USB_Host_Device_Manager___Polling_List[port_Number].first_Node = p_Polling_Node;
        }
    }
}

// Function to remove a device from the polling list
void USB_Host_Device___Remove_Polling_Device(uint8_t port_Number, uint8_t device_Address)
{
    // Get the polling node associated with the device
    USB_Host_Device_Manager___Polling_Device_Node_TypeDef* p_Polling_Node = &(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->polling_Process);
    if(p_Polling_Node != NULL)
    {
        // Disable the polling node and reset its parameters
        p_Polling_Node->enabled         = false;
        p_Polling_Node->device_Address  = 0;
        p_Polling_Node->polling_Target  = 0;
        p_Polling_Node->polling_Counter = 0;
        p_Polling_Node->callback        = NULL;

        // Update the polling list to remove the node
        if(p_Polling_Node == USB_Host_Device_Manager___Polling_List[port_Number].first_Node)
        {
            USB_Host_Device_Manager___Polling_List[port_Number].first_Node = NULL;
        }
        if(p_Polling_Node == USB_Host_Device_Manager___Polling_List[port_Number].last_Node)
        {
            USB_Host_Device_Manager___Polling_List[port_Number].last_Node = p_Polling_Node->previous_Node;
        }

        if(p_Polling_Node->previous_Node != NULL)
        {
            if(p_Polling_Node->next_Node != NULL)
            {
                p_Polling_Node->previous_Node->next_Node = p_Polling_Node->next_Node;
            }
            else
            {
                p_Polling_Node->previous_Node->next_Node = NULL;
            }
        }
    }
}

// Function to add a disconnection callback for a device
void USB_Host_Device_Manager___Device_Add_Disconnection_Callback(uint8_t port_Number, uint8_t device_Address, void callback(uint8_t port_Number, uint8_t device_Address))
{
    USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->callbacks.device_Disconnected_Callback = callback;
}

// Function to get a pointer to a device structure
USB_Host_Device_Manager___Device_TypeDef* USB_Host_Device_Manager___Get_Device_Pointer(uint8_t port_Number, uint8_t device_Address)
{
    return(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]);
}

// Function to check if a port is open (no device connected at address 0)
uint8_t USB_Host_Device_Manager___Is_Port_Open(uint8_t port_Number)
{
    return(USB_Host_Device_Manager___Port[port_Number].p_Device[0] == NULL);
}

// Function to get the device class from the device descriptor
uint8_t USB_Host_Device_Manager___Get_Device_Class(uint8_t port_Number, uint8_t device_Address)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor->bDeviceClass);
}

