Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HOST/Core/Src/USB_Host_Device_Manager.c
// Function to get the manufacturer string descriptor buffer
uint8_t* USB_Host_Device_Manager___Device_Get_Manufacturer_String_Descriptor_Buffer(uint8_t port_Number, uint8_t device_Address)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.manufacturer_String_Descriptor_Buffer);
}

// Function to get the product string descriptor buffer
uint8_t* USB_Host_Device_Manager___Device_Get_Product_String_Descriptor_Buffer(uint8_t port_Number, uint8_t device_Address)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.product_String_Descriptor_Buffer);
}

// Function to get the serial number string descriptor buffer
uint8_t* USB_Host_Device_Manager___Device_Get_Serial_Number_String_Descriptor_Buffer(uint8_t port_Number, uint8_t device_Address)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptor_Buffers.serial_Number_String_Descriptor_Buffer);
}

// Function to update the length of a specific string based on the descriptor
void USB_Host_Device_Manager___Update_String_Length(uint8_t port_Number, uint8_t device_Address, uint8_t string_Type)
{
    uint8_t string_Length = USB_Host_Device_Manager___Get_String_Descriptor_Length(port_Number, device_Address, string_Type);

    if(string_Length != 0)
    {
        string_Length = (string_Length - 2) / 2;  // Calculate the actual length of the string (excluding descriptor header)
    }

    switch(string_Type)
    {
    case USB_Host_Device_Manager___STRING_TYPE_LANGUAGE_ID:
    {
        USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.language_ID_List_Length = string_Length;
        break;
    }
    case USB_Host_Device_Manager___STRING_TYPE_MANUFACTURER:
    {
        USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.manufacturer_String_Length = string_Length;
        break;
    }
    case USB_Host_Device_Manager___STRING_TYPE_PRODUCT:
    {
        USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.product_String_Length = string_Length;
        break;
    }
    case USB_Host_Device_Manager___STRING_TYPE_SERIAL_NUMBER:
    {
        USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.serial_Number_String_Length = string_Length;
        break;
    }
    }
}

// Function to get a language ID from the language ID list
uint16_t USB_Host_Device_Manager___Device_Get_Language_ID(uint8_t port_Number, uint8_t device_Address, uint8_t language_Index)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->strings.p_Language_ID_List[language_Index]);
}

// Function to get the device descriptor structure
USB_Host___Device_Descriptor_TypeDef USB_Host_Device_Manager___Device_Get_Device_Descriptor(uint8_t port_Number, uint8_t device_Address)
{
    return (*(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.p_Device_Descriptor));
}

// Function to set the maximum packet size for an IN endpoint
void USB_Host_Device_Manager___Device_Set_In_Endpoint_Max_Packet_Size(uint8_t port_Number, uint8_t device_Address, uint8_t endpoint_Number, uint16_t max_Packet_Size)
{
    USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->in_Endpoint_Status[endpoint_Number].max_Packet_Size = max_Packet_Size;
}

// Function to set the maximum packet size for an OUT endpoint
void USB_Host_Device_Manager___Device_Set_Out_Endpoint_Max_Packet_Size(uint8_t port_Number, uint8_t device_Address, uint8_t endpoint_Number, uint16_t max_Packet_Size)
{
    USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->out_Endpoint_Status[endpoint_Number].max_Packet_Size = max_Packet_Size;
}

// Function to set the device configuration and update endpoint packet sizes
void USB_Host_Device_Manager___Set_Configuration(uint8_t port_Number, uint8_t device_Address, uint8_t configuration_Index)
{
    for(uint8_t i = 0; i < USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].p_Configuration_Descriptor->bNumInterfaces; i++)
    {
        for(uint8_t j = 0; j < USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[i].p_Interface_Descriptor->bNumEndpoints; j++)
        {
            uint8_t  endpoint_Address      = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[i].endpoint[j].p_Endpoint_Descriptor->bEndpointAddress & 0x0F;
            uint8_t  endpoint_Direction    = (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[i].endpoint[j].p_Endpoint_Descriptor->bEndpointAddress & 0x80) >> 7;
            uint16_t endpoint_Max_Packet_Size = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->descriptors.configuration[configuration_Index].interface[i].endpoint[j].p_Endpoint_Descriptor->wMaxPacketSize;

            if(endpoint_Direction == 1)  // IN endpoint
            {
                USB_Host_Device_Manager___Device_Set_In_Endpoint_Max_Packet_Size(port_Number, device_Address, endpoint_Address, endpoint_Max_Packet_Size);
            }
            else  // OUT endpoint
            {
                USB_Host_Device_Manager___Device_Set_Out_Endpoint_Max_Packet_Size(port_Number, device_Address, endpoint_Address, endpoint_Max_Packet_Size);
            }
        }
    }
}

// Function to get the maximum packet size for an OUT endpoint
uint32_t USB_Host_Device_Manager___Device_Get_Out_Endpoint_Max_Packet_Size(uint8_t port_Number, uint8_t device_Address, uint8_t endpoint_Number)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->out_Endpoint_Status[endpoint_Number].max_Packet_Size);
}

// Function to get the maximum packet size for an IN endpoint
uint32_t USB_Host_Device_Manager___Device_Get_In_Endpoint_Max_Packet_Size(uint8_t port_Number, uint8_t device_Address, uint8_t endpoint_Number)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->in_Endpoint_Status[endpoint_Number].max_Packet_Size);
}

