Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HOST/Core/Src/USB_Host_Device_Manager.c
// Function to get the current packet ID for an endpoint
uint8_t USB_Host_Device_Manager___Device_Get_Endpoint_Current_Packet_ID(uint8_t port_Number, uint8_t device_Address, uint8_t endpoint_Direction, uint8_t endpoint_Number)
{
    if (endpoint_Direction == USB_Host___TRANSFER_DIRECTION_OUT)
    {
        return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->out_Endpoint_Status[endpoint_Number].current_Packet_ID);
    }
    else
    {
        return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->in_Endpoint_Status[endpoint_Number].current_Packet_ID);
    }
}

// Function to set the current packet ID for an endpoint
void USB_Host_Device_Manager___Device_Set_Endpoint_Current_Packet_ID(uint8_t port_Number, uint8_t device_Address, uint8_t endpoint_Number, uint8_t endpoint_Direction, uint8_t Packet_ID)
{
    if (endpoint_Direction == USB_Host___TRANSFER_DIRECTION_OUT)
    {
        USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->out_Endpoint_Status[endpoint_Number].current_Packet_ID = Packet_ID;
    }
    else
    {
        USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->in_Endpoint_Status[endpoint_Number].current_Packet_ID = Packet_ID;
    }
}

// Function to check if a device is a low-speed device
uint8_t USB_Host_Device_Manager___Device_Is_Low_Speed_Device(uint8_t port_Number, uint8_t device_Address)
{
    return (USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address]->status.is_Low_Speed_Device);
}

// Function to remove a device from a port
void USB_Host_Device_Manager___Port_Remove_Device(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];
    USB_Host_Device_Manager___Free_Device(p_Device);  // Free the device structure
    USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address] = NULL;  // Remove the device from the port
}

// Function to set whether a device is the root device
void USB_Host_Device_Manager___Device_Set_Is_Root_Device(uint8_t port_Number, uint8_t device_Address, uint8_t is_Root_Device)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];
    if(p_Device != NULL)
    {
        p_Device->status.is_Root_Device = is_Root_Device;
    }
}

// Function to assign a device to a specific address on a port
int8_t USB_Host_Device_Manager___Port_Set_Device_To_Address(uint8_t port_Number, uint8_t device_Address, USB_Host_Device_Manager___Device_TypeDef* p_Device)
{
    if(USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address] == NULL)
    {
        USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address] = p_Device;
        p_Device->status.current_USB_Address = device_Address;
        return(EXIT_SUCCESS);
    }

    return(EXIT_FAILURE);
}

// Function to find a free device address on a port
uint8_t USB_Host_Device_Manager___Port_Get_Free_Device_Address(uint8_t port_Number)
{
    for (uint8_t i = 1; i < USB_Host_Device_Manager___PORT_DEVICE_LIMIT + 1; i++)
    {
        if (USB_Host_Device_Manager___Port[port_Number].p_Device[i] == NULL)
        {
            return (i);  // Return the first available address
        }
    }
    return (0);  // Return 0 if no address is available
}

// Function to copy a device pointer from one address to another on a port
void USB_Host_Device_Manager___Port_Copy_Device_To_Address(uint8_t port_Number, uint8_t device_Address, uint8_t new_Device_Address)
{
    USB_Host_Device_Manager___Port[port_Number].p_Device[new_Device_Address] = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];
}

// Function to reserve a new device address on a port
uint8_t USB_Host_Device_Manager___Reserve_New_Device_Address(uint8_t port_Number, uint8_t current_Device_Address)
{
    uint8_t new_Address = USB_Host_Device_Manager___Port_Get_Free_Device_Address(port_Number);
    if (new_Address != 0)
    {
        USB_Host_Device_Manager___Port_Copy_Device_To_Address(port_Number, current_Device_Address, new_Address);
    }
    return (new_Address);
}

// Function to change the current USB address of a device
void USB_Host_Device_Manager___Device_Change_Current_USB_Address(uint8_t port_Number, uint8_t current_Device_Address, uint8_t new_Device_Address)
{
    if(current_Device_Address == USB_Host_Device_Manager___Port[port_Number].port_Status.root_Device_Address)
    {
        USB_Host_Device_Manager___Port[port_Number].port_Status.root_Device_Address = new_Device_Address;
    }
    USB_Host_Device_Manager___Port[port_Number].p_Device[new_Device_Address] = USB_Host_Device_Manager___Port[port_Number].p_Device[current_Device_Address];
    USB_Host_Device_Manager___Port[port_Number].p_Device[current_Device_Address] = NULL;
    USB_Host_Device_Manager___Port[port_Number].p_Device[new_Device_Address]->status.current_USB_Address = new_Device_Address;
}

// Function to clear the device connected/disconnected flag on a port
void USB_Host_Device_Manager___Port_Clear_Device_Connected_Or_Disconnected_Flag(uint8_t port_Number)
{
    USB_Host_Device_Manager___Port[port_Number].port_Status.device_Connected_Or_Disconnected_Flag = false;
}

// Function to set the device connected/disconnected flag on a port
void USB_Host_Device_Manager___Port_Set_Device_Connected_Or_Disconnected_Flag(uint8_t port_Number)
{
    USB_Host_Device_Manager___Port[port_Number].port_Status.device_Connected_Or_Disconnected_Flag = true;
}

// Function to check if a device has been connected or disconnected on a port
uint8_t USB_Host_Device_Manager__Port_Is_Device_Connected_Or_Disconnected_Flag(uint8_t port_Number)
{
    return(USB_Host_Device_Manager___Port[port_Number].port_Status.device_Connected_Or_Disconnected_Flag);
}

// Function to handle device disconnection
void USB_Host_Device_Manager___Device_Disconnected(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if(p_Device != NULL)
    {
        USB_Host_Device___Remove_Polling_Device(port_Number, device_Address);  // Remove device from polling list
        USB_Host_Device_Manager___Port[port_Number].number_Of_Devices_Connected--;
        USB_Host_Device_Manager___Port[port_Number].port_Status.device_Connected_Or_Disconnected_Flag = true;
        p_Device->status.connection_Flag = true;
        p_Device->status.is_Connected = false;
        if (p_Device->callbacks.device_Disconnected_Callback != NULL)
        {
            // Call the disconnection callback if it's set
            p_Device->callbacks.device_Disconnected_Callback(port_Number, device_Address);
        }
    }
}

// Function to handle device connection
void USB_Host_Device_Manager___Device_Connected(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if(p_Device != NULL)
    {
        USB_Host_Device_Manager___Port[port_Number].number_Of_Devices_Connected++;
        USB_Host_Device_Manager___Port[port_Number].port_Status.device_Connected_Or_Disconnected_Flag = true;
        p_Device->status.connection_Flag = true;
        p_Device->status.is_Connected = true;
    }
}

