Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_HOST/Core/Src/USB_Host_Device_Manager.c
// Function to check if a device is connected
uint8_t USB_Host_Device_Manager___Is_Device_Connected(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if(p_Device != NULL)
    {
        return(p_Device->status.is_Connected);
    }
    return(0);
}

// Function to check the connection flag of a device
uint8_t USB_Host_Device_Manager___Device_Connection_Flag(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if(p_Device != NULL)
    {
        return(p_Device->status.connection_Flag);
    }

    return(0);
}

// Function to clear the connection flag of a device
void USB_Host_Device_Manager___Clear_Device_Connection_Flag(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if(p_Device != NULL)
    {
        p_Device->status.connection_Flag = false;
    }
}

// Function to set the port number in the device status
void USB_Host_Device_Manager___Device_Set_Port_Number(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if(p_Device != NULL)
    {
        p_Device->status.port_Number = port_Number;
    }
}

// Function to set the speed of a device
void USB_Host_Device_Manager___Device_Set_Speed(uint8_t port_Number, uint8_t device_Address, uint8_t device_Speed)
{
    USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if(p_Device != NULL)
    {
        if(device_Speed == USB_Host_Device_Manager___LOW_SPEED_DEVICE)
        {
            p_Device->status.is_Low_Speed_Device = 1;
            p_Device->status.is_High_Speed_Device = 0;
        }
        else if(device_Speed == USB_Host_Device_Manager___HIGH_SPEED_DEVICE)
        {
            p_Device->status.is_Low_Speed_Device = 0;
            p_Device->status.is_High_Speed_Device = 1;
        }
        else
        {
            p_Device->status.is_Low_Speed_Device = 0;
            p_Device->status.is_High_Speed_Device = 0;
        }
    }
}

// Function to get the root device address of a port
uint8_t USB_Host_Device_Manager___Port_Get_Root_Device_Address(uint8_t port_Number)
{
    return(USB_Host_Device_Manager___Port[port_Number].port_Status.root_Device_Address);
}

// Function to initialize device descriptor buffers
void USB_Host_Device_Manager___Device_Initialize_Buffers(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_TypeDef *p_Device = USB_Host_Device_Manager___Port[port_Number].p_Device[device_Address];

    if (p_Device != NULL)
    {
        p_Device->descriptors.p_Device_Descriptor = (USB_Host___Device_Descriptor_TypeDef*)(p_Device->descriptor_Buffers.device_Descriptor_Buffer);
        p_Device->strings.p_Language_ID_List      = (uint16_t*)&(p_Device->descriptor_Buffers.language_ID_Descriptor_Buffer[2]);
        p_Device->strings.p_Manufacturer_String   = (uint16_t*)&(p_Device->descriptor_Buffers.manufacturer_String_Descriptor_Buffer[2]);
        p_Device->strings.p_Product_String        = (uint16_t*)&(p_Device->descriptor_Buffers.product_String_Descriptor_Buffer[2]);
        p_Device->strings.p_Serial_Number_String  = (uint16_t*)&(p_Device->descriptor_Buffers.serial_Number_String_Descriptor_Buffer[2]);
        for(uint8_t i = 0; i < USB_Host_Config___DEVICE_MAX_NUMBER_OF_CONFIGURATIONS; i++)
        {
            p_Device->descriptors.configuration[i].p_Configuration_Descriptor = (USB_Host___Configuration_Descriptor_TypeDef*)(p_Device->descriptor_Buffers.configuration_Descriptor_Buffer[i]);
        }
    }
}

// Function to handle start-of-frame events for polling devices
void USB_Host_Device_Manager___Handle_Start_Of_Frame(uint8_t port_Number)
{
    if(USB_Host_Device_Manager___Polling_List->first_Node != NULL)
    {
        USB_Host_Device_Manager___Polling_Device_Node_TypeDef* p_Polling_Node = USB_Host_Device_Manager___Polling_List->first_Node;
        while (p_Polling_Node != NULL)
        {
            p_Polling_Node->polling_Counter++;
            if (p_Polling_Node->polling_Counter >= (p_Polling_Node->polling_Target))
            {
                p_Polling_Node->polling_Counter = 0;
                p_Polling_Node->callback(port_Number, p_Polling_Node->device_Address);  // Invoke the callback function
            }
            p_Polling_Node = p_Polling_Node->next_Node;  // Move to the next node in the list
        }
    }
}

// Function to set up a device after allocation
void USB_Host_Device_Manager___Setup_Device(uint8_t port_Number, uint8_t device_Address, uint8_t is_Root_Device, uint8_t device_Speed)
{
    USB_Host_Device_Manager___Device_Set_Is_Root_Device(port_Number, device_Address, is_Root_Device);
    USB_Host_Device_Manager___Device_Initialize_Buffers(port_Number, device_Address);
    USB_Host_Device_Manager___Device_Set_Port_Number(port_Number, 0);
    USB_Host_Device_Manager___Device_Set_Speed(port_Number, 0, device_Speed);
}

// Function to allocate a device at address zero
int8_t USB_Host_Device_Manager___Allocate_Device_At_Address_Zero(uint8_t port_Number, uint8_t device_Speed, uint8_t is_Root_Device)
{
    if(USB_Host_Device_Manager___Port[port_Number].p_Device[0] == NULL)
    {
        USB_Host_Device_Manager___Device_TypeDef* p_Device = USB_Host_Device_Manager___Allocate_Device();
        if(p_Device != NULL)
        {
            if(USB_Host_Device_Manager___Port_Set_Device_To_Address(port_Number, 0, p_Device) == EXIT_SUCCESS)
            {
                USB_Host_Device_Manager___Setup_Device(port_Number, 0, is_Root_Device, device_Speed);

                return(EXIT_SUCCESS);
            }
        }
    }
    return(EXIT_FAILURE);
}

// Function to enable a device (mark as connected)
void USB_Host_Device_Manager___Enable_Device(uint8_t port_Number, uint8_t device_Address)
{
    USB_Host_Device_Manager___Device_Connected(port_Number, device_Address);
}
